DataProcessors/СМ_СкопироватьФайл_LCV_XML_сСайта_AVITO_RU_ИЗагрузитьСправочники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СМ_СкопироватьФайл_LCV_XML_сСайта_AVITO_RU_ИЗагрузитьСправочники</Name>
			<Comment>Скопировать файл LCV.XML с сайта AVITO.RU и загрузить справочники</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПределСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/Модели_Авито.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Модели_Авито</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Марка_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммерция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Модификации_Авито.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Модификации_Авито</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Модели_Авито</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГенерацияАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Генерации_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммерция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Комплектации_Авито.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Комплектации_Авито</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Модификации_Авито</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГенерацияАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Генерации_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммерция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/СМ_СкопироватьФайл_LCV_XML_сСайта_AVITO_RU_ИЗагрузитьСправочники/Ext/ObjectModule.bsl
Процедура АвитоКоммерческийЗагрузкаСправочниковМодуль() Экспорт
	
	ВнутреннийАдресСервера = "https://autoload.avito.ru/format/lcv.xml";
	
	ИмяФайлаНазначение = ПолучитьИмяВременногоФайла("xml");
	ФайлНаДиске = Новый Файл(ИмяФайлаНазначение);
	
	Для Счетчик = 1 По 10 Цикл
		КопироватьФайл(ВнутреннийАдресСервера,ИмяФайлаНазначение);
		Если ФайлНаДиске.Существует() Тогда
			Прервать;
		КонецЕсли;
		Пауза30секунд = 30;
		КонДата = ТекущаяДата() + Пауза30секунд;
		Пока ТекущаяДата() < КонДата Цикл
			//...  
		КонецЦикла;
	КонецЦикла; 
	
	Если НЕ ФайлНаДиске.Существует() Тогда
		#Если НаКлиенте Тогда
			Попытка
				Сообщить("ОШИБКА! Информация с сайта не скопирована в файл: <"+СокрЛП(ИмяФайлаНазначение)+">",СтатусСообщения.ОченьВажное);
			Исключение
				//				
			КонецПопытки;		 
		#КонецЕсли
		Возврат;
	Иначе
		#Если НаКлиенте Тогда
			Попытка
				Сообщить("Информация с сайта скопирована в файл: <"+СокрЛП(ФайлНаДиске.ПолноеИмя)+">");
			Исключение
				//				
			КонецПопытки;		 
		#КонецЕсли
	КонецЕсли;  
	
 	//==================================================================================================
	
	ёё = 0;
	
  	ЧтениеXML = Новый ЧтениеXML();
	
	ЧтениеXML.ОткрытьФайл(ИмяФайлаНазначение); 
	
	Счетчик = 0;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Счетчик = Счетчик + 1;
		
		Если ПределСтрок > 0 Тогда
			Если Счетчик > ПределСтрок Тогда
				Прервать;
			КонецЕсли;			                                
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ТекущееИмя = ЧтениеXML.Имя;					
			#Если Клиент Тогда
				//Если Отладка Тогда 	СМГ_Сообщить("Начало элемента "+ТекущееИмя); КонецЕсли;
			#КонецЕсли
			Если ТекущееИмя="Brand" Тогда  
				Наименование = ЧтениеXML.ПолучитьАтрибут("name");  	
				МаркаАвито =  НайтиСоздатьМарку(Наименование);    
			КонецЕсли;
			Если ТекущееИмя="Model" Тогда  
				Наименование = ЧтениеXML.ПолучитьАтрибут("name");                  
				МодельАвито =  НайтиСоздатьМодель(Наименование,МаркаАвито);
			КонецЕсли;
			Если ТекущееИмя="Generation" Тогда  
				Наименование = ЧтениеXML.ПолучитьАтрибут("name");                  
				ГенерацияАвито =  НайтиСоздатьГенерацию(Наименование,МодельАвито);
			КонецЕсли; 	
			Если ТекущееИмя="Modification" Тогда  
				Наименование = ЧтениеXML.ПолучитьАтрибут("name");                  
				МодификацияАвито =  НайтиСоздатьМодификацию(Наименование,МодельАвито,ГенерацияАвито);
			КонецЕсли;
			Если ТекущееИмя="Trim" Тогда  
				Наименование = ЧтениеXML.ПолучитьАтрибут("name");                  
				КомплектацияАвито = НайтиСоздатьКомплектацию(Наименование,МодификацияАвито);
			КонецЕсли; 		
  			Если ТекущееИмя="Body" Тогда  
				Наименование = ЧтениеXML.ПолучитьАтрибут("name");                  
				ТипКузоваАвито =  НайтиСоздатьТипКузова(Наименование);
			КонецЕсли; 		
 		КонецЕсли;                                                                                                                           
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			//ТекущееЗначение = ЧтениеXML.Значение;
			//#Если Клиент Тогда
			//	Если Отладка Тогда 	СМГ_Сообщить("Текущее значение "+ТекущееЗначение);КонецЕсли;	
			//#КонецЕсли
			//Если ЭтоМарка Тогда
			//	Если ТекущееИмя="name" Тогда 
			//		Наименование = ТекущееЗначение;			
			//КонецЕсли;
			//КонецЕсли;
		КонецЕсли;	
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			ТекущееИмя = ЧтениеXML.Имя;
			#Если Клиент Тогда
				//Если Отладка Тогда 	СМГ_Сообщить("Конец элемента "+ТекущееИмя);	КонецЕсли;	
			#КонецЕсли	
			//	Если ТекущееИмя="Brand" Тогда
			//		Если Наименование <> "" Тогда
			//			МаркаАвито =  НайтиСоздатьМарку(Наименование);
			//		КонецЕсли;
			//КонецЕсли;
			//	Если ТекущееИмя="Model" Тогда
			//		Если Наименование <> "" И Не обЗначениеНеЗаполнено(МаркаАвито) Тогда
			//			МодельАвито =  НайтиСоздатьМодель(Наименование,МаркаАвито);
			//		КонецЕсли;
			//КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();	
	
КонецПроцедуры //АвитоКоммерческийЗагрузкаСправочниковМодуль()

Функция НайтиСоздатьМарку(Наименование) Экспорт
	
	НовМарка = Справочники.Марка_Авито.СоздатьЭлемент();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Марка_Авито.Ссылка,
	|	Марка_Авито.Наименование,
	|	Марка_Авито.Коммерция
	|ИЗ
	|	Справочник.Марка_Авито КАК Марка_Авито
	|ГДЕ
	|	Марка_Авито.Наименование = &Наименование
	|	И Марка_Авито.Коммерция = ИСТИНА";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовМарка = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
  	
	Если обЗначениеНеЗаполнено(НовМарка.Ссылка) Тогда
		
		НовМарка.Наименование = Наименование;
		НовМарка.Коммерция = Истина;
		НовМарка.УстановитьНовыйКод();

		Попытка НовМарка.Записать(); Исключение  КонецПопытки;
  		
	КонецЕсли;
	
	Возврат НовМарка.Ссылка;
	
КонецФункции // НайтиИлиСоздатьМарку(Наименование) 

Функция НайтиСоздатьМодель(Наименование,МаркаАвито) Экспорт
	
	НовМодель = Справочники.Модели_Авито.СоздатьЭлемент();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Модели_Авито.Ссылка,
	|	Модели_Авито.Наименование,
	|	Модели_Авито.МаркаАвито,
	|	Модели_Авито.Коммерция
	|ИЗ
	|	Справочник.Модели_Авито КАК Модели_Авито
	|ГДЕ
	|	Модели_Авито.Наименование = &Наименование
	|	И Модели_Авито.Коммерция
	|	И Модели_Авито.МаркаАвито = &МаркаАвито";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
 	Запрос.УстановитьПараметр("МаркаАвито", МаркаАвито);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовМодель = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовМодель.Ссылка) Тогда
		
		НовМодель.Наименование = Наименование;
		НовМодель.Коммерция = Истина;
		НовМодель.МаркаАвито = МаркаАвито;
		НовМодель.УстановитьНовыйКод();
		
		Попытка	НовМодель.Записать(); Исключение КонецПопытки;
		
	КонецЕсли;	
	
	Возврат НовМодель.Ссылка;
	
КонецФункции // НайтиИлиСоздатьМодель(Наименование,Марка)

Функция НайтиСоздатьМодификацию(Наименование,МодельАвито,ГенерацияАвито) Экспорт
	
	НовМодификация = Справочники.Модификации_Авито.СоздатьЭлемент();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Модификации_Авито.Ссылка,
	|	Модификации_Авито.Наименование,
	|	Модификации_Авито.Владелец,
	|	Модификации_Авито.Коммерция,
	|	Модификации_Авито.ГенерацияАвито
	|ИЗ
	|	Справочник.Модификации_Авито КАК Модификации_Авито
	|ГДЕ
	|	Модификации_Авито.Наименование = &Наименование
	|	И Модификации_Авито.Коммерция
	|	И Модификации_Авито.Владелец = &МодельАвито
	|	И Модификации_Авито.ГенерацияАвито = &ГенерацияАвито";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
 	Запрос.УстановитьПараметр("МодельАвито", МодельАвито);
	Запрос.УстановитьПараметр("ГенерацияАвито", ГенерацияАвито);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовМодификация = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовМодификация.Ссылка) Тогда
		
		НовМодификация.Наименование = Наименование;
		НовМодификация.Коммерция = Истина;
		НовМодификация.Владелец = МодельАвито; 
		НовМодификация.ГенерацияАвито = ГенерацияАвито; 
		НовМодификация.УстановитьНовыйКод();
		
		Попытка	НовМодификация.Записать(); Исключение КонецПопытки;
		
	КонецЕсли;
 
	Если Отладка Тогда 	 
		СМГ_Сообщить("Создана/обновлена модификация "+НовМодификация+" с владельцем-моделью "+МодельАвито+" у которой марка "+МодельАвито.МаркаАвито+" и генерация "+НовМодификация.ГенерацияАвито);
	КонецЕсли;
	
	Возврат НовМодификация.Ссылка;
	
КонецФункции // НайтиИлиСоздатьМодель(Наименование,МодельАвито)

Функция НайтиСоздатьКомплектацию(Наименование,МодификацияАвито) Экспорт
	
	НовКомплектация = Справочники.Комплектации_Авито.СоздатьЭлемент();
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Комплектации_Авито.Ссылка,
	|	Комплектации_Авито.Наименование,
	|	Комплектации_Авито.Владелец,
	|	Комплектации_Авито.Коммерция
	|ИЗ
	|	Справочник.Комплектации_Авито КАК Комплектации_Авито
	|ГДЕ
	|	Комплектации_Авито.Наименование = &Наименование
	|	И Комплектации_Авито.Коммерция
	|	И Комплектации_Авито.Владелец = &МодификацияАвито";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
 	Запрос.УстановитьПараметр("МодификацияАвито", МодификацияАвито);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовКомплектация = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовКомплектация.Ссылка) Тогда
		
		НовКомплектация.Наименование = Наименование;
		НовКомплектация.Коммерция = Истина;
		НовКомплектация.Владелец = МодификацияАвито;
		НовКомплектация.УстановитьНовыйКод();
		
		Попытка	НовКомплектация.Записать(); Исключение КонецПопытки;
		
	КонецЕсли;
 
	Если Отладка Тогда 	 
		СМГ_Сообщить("Создана/обновлена комплектация "+НовКомплектация+" с владельцем-модификацией "+МодификацияАвито+" у которой модель "+МодификацияАвито.Владелец);
	КонецЕсли;
	
	Возврат НовКомплектация.Ссылка;
	
КонецФункции // НайтиИлиСоздатьМодель(Наименование,Марка)

Функция НайтиСоздатьТипКузова(Наименование) Экспорт

 	ТипКузоваАвитоКоммерческий = Справочники.СМ_ТипыКузововАвито.СоздатьЭлемент();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ТипыКузововАвито.Ссылка,
	|	СМ_ТипыКузововАвито.Наименование
	|ИЗ
	|	Справочник.СМ_ТипыКузововАвито КАК СМ_ТипыКузововАвито
	|ГДЕ
	|	СМ_ТипыКузововАвито.Наименование = &Наименование
	|	И СМ_ТипыКузововАвито.Коммерческий";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТипКузоваАвитоКоммерческий = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
 	КонецЦикла;
	
 	Если обЗначениеНеЗаполнено(ТипКузоваАвитоКоммерческий.Ссылка) Тогда
		
		БылиОшибки = Ложь;
 		ТипКузоваАвитоКоммерческий.Наименование = Наименование;
		ТипКузоваАвитоКоммерческий.Коммерческий = Истина;		
		ТипКузоваАвитоКоммерческий.УстановитьНовыйКод();
 		
		Попытка	
			ТипКузоваАвитоКоммерческий.Записать(); 
 		Исключение    
			БылиОшибки = Истина;
 		КонецПопытки;

		Если Отладка Тогда 	    
			Если НЕ БылиОшибки Тогда 	    
	 			СМГ_Сообщить("Записан новый элемент справочника СМ_ТипыКузововАвито  с наименованием = <"+Наименование+">.",СтатусСообщения.ОченьВажное);
	  		Иначе
	 			СМГ_Сообщить("ОШИБКА! Не удалось записать элемент справочника СМ_ТипыКузововАвито  с наименованием = <"+Наименование+">.",СтатусСообщения.ОченьВажное);
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;
 
	Если Отладка Тогда 	    
 		СМГ_Сообщить("Обнаружен элемент справочника СМ_ТипыКузововАвито = <"+ТипКузоваАвитоКоммерческий+">." );
  	КонецЕсли;
	
	Возврат ТипКузоваАвитоКоммерческий.Ссылка;
	
КонецФункции // НайтиСоздатьТипКузова(Наименование)

Функция НайтиСоздатьГенерацию(Наименование,МодельАвито) Экспорт
	
	НовГенерация = Справочники.Генерации_Авито.СоздатьЭлемент();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Генерации_Авито.Ссылка,
	|	Генерации_Авито.Наименование,
	|	Генерации_Авито.Владелец
	|ИЗ
	|	Справочник.Генерации_Авито КАК Генерации_Авито
	|ГДЕ
	|	Генерации_Авито.Наименование = &Наименование
	|	И Генерации_Авито.Владелец = &МодельАвито";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
 	Запрос.УстановитьПараметр("МодельАвито", МодельАвито);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовГенерация = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовГенерация.Ссылка) Тогда
		
		НовГенерация.Наименование = Наименование;
 		НовГенерация.Владелец = МодельАвито; 
		НовГенерация.УстановитьНовыйКод();
		
		Попытка	НовГенерация.Записать(); Исключение КонецПопытки;
		
	КонецЕсли;
 
	Если Отладка Тогда 	 
		СМГ_Сообщить("Создана/обновлена генерация (поколение) "+НовГенерация+" с владельцем-моделью "+МодельАвито+" у которой марка "+МодельАвито.МаркаАвито);
	КонецЕсли;
	
	Возврат НовГенерация.Ссылка;
	
КонецФункции // НайтиСоздатьГенерацию(Наименование,МодельАвито)
